{
/* Exception reason (not displayed yet) */
"Error after gpg execution" = "Virhe gpg:n suorituksessa";
"gpg execution manually interrupted" = "gpg:n suoritus keskeytetty";

/* Passphrase entry message */
"Enter passphrase for %@:" = "Anna salauslause kohteelle %@:"; // Param is the userID of a key
"Enter passphrase for this message:" = "Anna viestin salauslause:"; // Symmetric encryption/decryption, no key

/* Keychain support */
"Can't get default keychain!" = "En löyudä oletusavainnippua!";
"Password buffer too small for keychain!" = "Salasanapuskuri oli liian pieni avainnipulle!";
"Invalid reference to the keychain item for %s:%@" = "Virheellinen viittaus avainnipun kohteelle %s:%@"; // 1st argument is service, 2nd argument is user name
"Unknown problem accessing keychain! Error %d" = "Tuntematon virhe avainnnipun käsittelyssä! Virhe %d";
"Can't store the password for %s:%@: it is too long for the keychain!" = "En voi tallettaa salasanaa %s:%@: se on liian pitkä avainnippuun!"; // 1st argument is service, 2nd argument is user name
}